
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//++ доработка диплома 
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда
		ВывестиРеквизитыПрограммноНаФорму();
	КонецЕсли;	
	//-- конец доработки диплома	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	//++ доработка диплома	
	ВывестиРеквизитыПрограммноНаФорму();
	//-- конец доработки диплома	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВывестиРеквизитыПрограммноНаФорму()
   //++ доработка диплома
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда
		
		ГруппаСрокДоговора = Элементы.Добавить("ГруппаСрокДоговора", Тип("ГруппаФормы"));
		ГруппаСрокДоговора.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаСрокДоговора.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		
		РеквизитДатаНачала = Элементы.Добавить("ВКМ_ДатаНачалаДействияДоговора", Тип("ПолеФормы"), ГруппаСрокДоговора);
		РеквизитДатаНачала.Вид = ВидПоляФормы.ПолеВвода;
		РеквизитДатаНачала.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействияДоговора";
		РеквизитДатаНачала.Заголовок = "Дата начала действия договора";
		
		РеквизитДатаОкончания = Элементы.Добавить("ВКМ_ДатаОкончанияДействияДоговора", Тип("ПолеФормы"), ГруппаСрокДоговора); 
		РеквизитДатаОкончания.Вид =      ВидПоляФормы.ПолеВвода;
		РеквизитДатаОкончания.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействияДоговора";
		РеквизитДатаОкончания.Заголовок = "Дата окончания действия договора";
		
		ГруппаСтоимость = Элементы.Добавить("ГруппаСтоимость", Тип("ГруппаФормы"));
		ГруппаСтоимость.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаСтоимость.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;		

		РеквизитСуммаАбПлаты = Элементы.Добавить("ВКМ_СуммаАбонентскойПлатыЕжемесечно", Тип("ПолеФормы"), ГруппаСтоимость);
		РеквизитСуммаАбПлаты.Вид = ВидПоляФормы.ПолеВвода;
		РеквизитСуммаАбПлаты.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлатыЕжемесечно";
		РеквизитСуммаАбПлаты.Заголовок = "Сумма абонентской платы (ежемесечно)";
		
		РеквизитСтоимостьЧаса = Элементы.Добавить("ВКМ_СтоимостьЧасаРабот", Тип("ПолеФормы"), ГруппаСтоимость);
		РеквизитСтоимостьЧаса.Вид = ВидПоляФормы.ПолеВвода;
		РеквизитСтоимостьЧаса.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРабот";
		РеквизитСтоимостьЧаса.Заголовок = "Стоимость часа работ";
		
	КонецЕсли;	
	//-- конец доработки диплома	
КонецПроцедуры	


#КонецОбласти
